FV2610/E_0035.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
MaBiS

7.21.1: AD: Deaktivierung eines MaBiS-ZP für Bilanzierungsgebietssummenzeitreihen vom ÜNB an BIKO und NB



end title
:<b>E_0035</b>;
note right
<b><i>Prüfende Rolle: BIKO
end note

if (<b>1: </b> Erfolgt die Deaktivierung nach Ablauf der Clearingfrist für die KBKA?) then (ja)
    :A01;
    note left
        Cluster: Ablehnung
        Fristüberschreitung
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Erfolgt die Deaktivierung zum Monatsersten 00:00 Uhr?) then (ja)
else (nein)
    :A02;
    note left
        Cluster: Ablehnung
        Gewählter Zeitpunkt nicht zulässig
    endnote
    kill;
endif
if (<b>3: </b> Ist das Bilanzierungsgebiet zum Aktivierungsende in der Regelzone des BIKO gültig?) then (ja)
else (nein)
    :A03;
    note left
        Cluster: Ablehnung
        Bilanzierungsgebiet nicht gültig
    endnote
    kill;
endif
if (<b>4: </b> Ist der MaBiS-ZP zum Aktivierungsende bereits deaktiviert?) then (ja)
    :A04;
    note left
        Cluster: Ablehnung
        MaBiS-ZP bereits deaktiviert
    endnote
    kill;
else (nein)
endif
if (<b>5: </b> Sind für den MaBiS-ZP Zeitreihen nach dem Deaktivierungszeitpunkt bereits vorhanden?) then (ja)
    :A05;
    note left
        Cluster: Ablehnung
        Deaktivierung, Zeitreihen vorhanden
    endnote
    kill;
else (nein)
    :A06;
    note left
        Cluster: Zustimmung
        Deaktivierung durchgeführt
    endnote
    kill;
endif

@enduml
